node-js-main-thread-analises/artillery-test/result.txt
Test run id: tpryt_mxpj5zxzc4aqw3z5nbxhjacjaz77p_9xy6
Phase started: Warm up phase (index: 0, duration: 10s) 23:13:34(-0300)

Phase completed: Warm up phase (index: 0, duration: 10s) 23:13:44(-0300)

Phase started: Ramp up load (index: 1, duration: 20s) 23:13:44(-0300)

Phase completed: Ramp up load (index: 1, duration: 20s) 23:14:04(-0300)

Phase started: Spike phase (index: 2, duration: 60s) 23:14:04(-0300)

--------------------------------------
Metrics for period to: 23:13:40(-0300) (width: 4.159s)
--------------------------------------

apdex.frustrated: .............................................................. 0
apdex.satisfied: ............................................................... 9
apdex.tolerated: ............................................................... 0
http.codes.200: ................................................................ 9
http.downloaded_bytes: ......................................................... 42
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 9
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 2
  mean: ........................................................................ 1
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.responses: ................................................................ 9
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 9
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 0
  max: ......................................................................... 2
  mean: ........................................................................ 1
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 1
vusers.completed: .............................................................. 9
vusers.created: ................................................................ 9
vusers.created_by_name.0: ...................................................... 9
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6.3
  max: ......................................................................... 55.1
  mean: ........................................................................ 20.2
  median: ...................................................................... 10.7
  p95: ......................................................................... 54.1
  p99: ......................................................................... 54.1


--------------------------------------
Metrics for period to: 23:13:50(-0300) (width: 9.265s)
--------------------------------------

apdex.frustrated: .............................................................. 0
apdex.satisfied: ............................................................... 49
apdex.tolerated: ............................................................... 0
http.codes.200: ................................................................ 49
http.downloaded_bytes: ......................................................... 234
http.request_rate: ............................................................. 7/sec
http.requests: ................................................................. 49
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 2
  mean: ........................................................................ 1
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 49
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 49
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 0
  max: ......................................................................... 2
  mean: ........................................................................ 1
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
vusers.completed: .............................................................. 49
vusers.created: ................................................................ 49
vusers.created_by_name.0: ...................................................... 49
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 57.6
  mean: ........................................................................ 10.6
  median: ...................................................................... 8.2
  p95: ......................................................................... 20.3
  p99: ......................................................................... 34.1


--------------------------------------
Metrics for period to: 23:14:00(-0300) (width: 9.422s)
--------------------------------------

apdex.frustrated: .............................................................. 0
apdex.satisfied: ............................................................... 75
apdex.tolerated: ............................................................... 0
http.codes.200: ................................................................ 75
http.downloaded_bytes: ......................................................... 354
http.request_rate: ............................................................. 9/sec
http.requests: ................................................................. 75
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 75
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 75
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 0
  max: ......................................................................... 5
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
vusers.completed: .............................................................. 75
vusers.created: ................................................................ 75
vusers.created_by_name.0: ...................................................... 75
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.2
  max: ......................................................................... 53.1
  mean: ........................................................................ 6.7
  median: ...................................................................... 5.4
  p95: ......................................................................... 13.3
  p99: ......................................................................... 53


--------------------------------------
Metrics for period to: 23:14:10(-0300) (width: 9.907s)
--------------------------------------

apdex.frustrated: .............................................................. 8141
apdex.satisfied: ............................................................... 1495
apdex.tolerated: ............................................................... 9355
http.codes.200: ................................................................ 18991
http.downloaded_bytes: ......................................................... 89796
http.request_rate: ............................................................. 3461/sec
http.requests: ................................................................. 29889
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 3618
  mean: ........................................................................ 170.9
  median: ...................................................................... 153
  p95: ......................................................................... 376.2
  p99: ......................................................................... 620.3
http.responses: ................................................................ 18991
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 18991
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 0
  max: ......................................................................... 3618
  mean: ........................................................................ 170.9
  median: ...................................................................... 153
  p95: ......................................................................... 376.2
  p99: ......................................................................... 620.3
vusers.completed: .............................................................. 18991
vusers.created: ................................................................ 29890
vusers.created_by_name.0: ...................................................... 29890
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.3
  max: ......................................................................... 4147.2
  mean: ........................................................................ 513.8
  median: ...................................................................... 257.3
  p95: ......................................................................... 1720.2
  p99: ......................................................................... 3678.4


--------------------------------------
Metrics for period to: 23:14:20(-0300) (width: 9.999s)
--------------------------------------

apdex.frustrated: .............................................................. 25860
apdex.satisfied: ............................................................... 3
apdex.tolerated: ............................................................... 3163
errors.ETIMEDOUT: .............................................................. 6267
http.codes.200: ................................................................ 29026
http.downloaded_bytes: ......................................................... 137232
http.request_rate: ............................................................. 3845/sec
http.requests: ................................................................. 37833
http.response_time:
  min: ......................................................................... 6
  max: ......................................................................... 8078
  mean: ........................................................................ 324.5
  median: ...................................................................... 232.8
  p95: ......................................................................... 804.5
  p99: ......................................................................... 1978.7
http.responses: ................................................................ 29026
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 29026
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 6
  max: ......................................................................... 8078
  mean: ........................................................................ 324.5
  median: ...................................................................... 232.8
  p95: ......................................................................... 804.5
  p99: ......................................................................... 1978.7
vusers.completed: .............................................................. 29026
vusers.created: ................................................................ 37834
vusers.created_by_name.0: ...................................................... 37834
vusers.failed: ................................................................. 6267
vusers.session_length:
  min: ......................................................................... 99.9
  max: ......................................................................... 9702.8
  mean: ........................................................................ 1783.8
  median: ...................................................................... 907
  p95: ......................................................................... 7865.6
  p99: ......................................................................... 8868.4


--------------------------------------
Metrics for period to: 23:14:30(-0300) (width: 9.999s)
--------------------------------------

apdex.frustrated: .............................................................. 27484
apdex.satisfied: ............................................................... 217
apdex.tolerated: ............................................................... 2450
errors.ETIMEDOUT: .............................................................. 7477
http.codes.200: ................................................................ 30151
http.downloaded_bytes: ......................................................... 142621
http.request_rate: ............................................................. 4075/sec
http.requests: ................................................................. 40045
http.response_time:
  min: ......................................................................... 8
  max: ......................................................................... 7685
  mean: ........................................................................ 337
  median: ...................................................................... 257.3
  p95: ......................................................................... 772.9
  p99: ......................................................................... 1525.7
http.responses: ................................................................ 30151
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 30151
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 8
  max: ......................................................................... 7685
  mean: ........................................................................ 337
  median: ...................................................................... 257.3
  p95: ......................................................................... 772.9
  p99: ......................................................................... 1525.7
vusers.completed: .............................................................. 30151
vusers.created: ................................................................ 40045
vusers.created_by_name.0: ...................................................... 40045
vusers.failed: ................................................................. 7477
vusers.session_length:
  min: ......................................................................... 40.2
  max: ......................................................................... 10332.8
  mean: ........................................................................ 1758.2
  median: ...................................................................... 1064.4
  p95: ......................................................................... 8024.5
  p99: ......................................................................... 8868.4


--------------------------------------
Metrics for period to: 23:14:40(-0300) (width: 9.999s)
--------------------------------------

apdex.frustrated: .............................................................. 25603
apdex.satisfied: ............................................................... 47
apdex.tolerated: ............................................................... 2073
errors.ETIMEDOUT: .............................................................. 9516
http.codes.200: ................................................................ 27723
http.downloaded_bytes: ......................................................... 131149
http.request_rate: ............................................................. 3968/sec
http.requests: ................................................................. 37241
http.response_time:
  min: ......................................................................... 9
  max: ......................................................................... 7683
  mean: ........................................................................ 427.5
  median: ...................................................................... 327.1
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 2231
http.responses: ................................................................ 27723
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 27723
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 9
  max: ......................................................................... 7683
  mean: ........................................................................ 427.5
  median: ...................................................................... 327.1
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 2231
vusers.completed: .............................................................. 27723
vusers.created: ................................................................ 37240
vusers.created_by_name.0: ...................................................... 37240
vusers.failed: ................................................................. 9516
vusers.session_length:
  min: ......................................................................... 32.4
  max: ......................................................................... 10507.9
  mean: ........................................................................ 2283
  median: ...................................................................... 1380.5
  p95: ......................................................................... 8352
  p99: ......................................................................... 9230.4


--------------------------------------
Metrics for period to: 23:14:50(-0300) (width: 9.999s)
--------------------------------------

apdex.frustrated: .............................................................. 28270
apdex.satisfied: ............................................................... 197
apdex.tolerated: ............................................................... 3727
errors.ETIMEDOUT: .............................................................. 9326
http.codes.200: ................................................................ 32194
http.downloaded_bytes: ......................................................... 152273
http.request_rate: ............................................................. 4445/sec
http.requests: ................................................................. 43152
http.response_time:
  min: ......................................................................... 12
  max: ......................................................................... 8996
  mean: ........................................................................ 431.3
  median: ...................................................................... 273.2
  p95: ......................................................................... 982.6
  p99: ......................................................................... 3678.4
http.responses: ................................................................ 32194
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 32194
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 12
  max: ......................................................................... 8996
  mean: ........................................................................ 431.3
  median: ...................................................................... 273.2
  p95: ......................................................................... 982.6
  p99: ......................................................................... 3678.4
vusers.completed: .............................................................. 32194
vusers.created: ................................................................ 43153
vusers.created_by_name.0: ...................................................... 43153
vusers.failed: ................................................................. 9326
vusers.session_length:
  min: ......................................................................... 49.9
  max: ......................................................................... 10215.7
  mean: ........................................................................ 1910.4
  median: ...................................................................... 1300.1
  p95: ......................................................................... 7865.6
  p99: ......................................................................... 8868.4


--------------------------------------
Metrics for period to: 23:15:00(-0300) (width: 9.999s)
--------------------------------------

apdex.frustrated: .............................................................. 28186
apdex.satisfied: ............................................................... 206
apdex.tolerated: ............................................................... 1809
errors.ECONNRESET: ............................................................. 8
errors.ETIMEDOUT: .............................................................. 11954
http.codes.200: ................................................................ 30201
http.downloaded_bytes: ......................................................... 142915
http.request_rate: ............................................................. 4333/sec
http.requests: ................................................................. 42227
http.response_time:
  min: ......................................................................... 13
  max: ......................................................................... 9218
  mean: ........................................................................ 488.1
  median: ...................................................................... 327.1
  p95: ......................................................................... 1200.1
  p99: ......................................................................... 3534.1
http.responses: ................................................................ 30201
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 30201
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 13
  max: ......................................................................... 9218
  mean: ........................................................................ 488.1
  median: ...................................................................... 327.1
  p95: ......................................................................... 1200.1
  p99: ......................................................................... 3534.1
vusers.completed: .............................................................. 30201
vusers.created: ................................................................ 42226
vusers.created_by_name.0: ...................................................... 42226
vusers.failed: ................................................................. 11962
vusers.session_length:
  min: ......................................................................... 63.6
  max: ......................................................................... 10401.7
  mean: ........................................................................ 2168.4
  median: ...................................................................... 1465.9
  p95: ......................................................................... 8352
  p99: ......................................................................... 9801.2


--------------------------------------
Metrics for period to: 23:15:10(-0300) (width: 9.999s)
--------------------------------------

apdex.frustrated: .............................................................. 28317
apdex.satisfied: ............................................................... 59
apdex.tolerated: ............................................................... 1035
errors.ECONNRESET: ............................................................. 38
errors.ETIMEDOUT: .............................................................. 10673
http.codes.200: ................................................................ 29411
http.downloaded_bytes: ......................................................... 139007
http.request_rate: ............................................................. 3855/sec
http.requests: ................................................................. 38090
http.response_time:
  min: ......................................................................... 12
  max: ......................................................................... 8509
  mean: ........................................................................ 487
  median: ...................................................................... 354.3
  p95: ......................................................................... 982.6
  p99: ......................................................................... 3011.6
http.responses: ................................................................ 29411
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 29411
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 12
  max: ......................................................................... 8509
  mean: ........................................................................ 487
  median: ...................................................................... 354.3
  p95: ......................................................................... 982.6
  p99: ......................................................................... 3011.6
vusers.completed: .............................................................. 29409
vusers.created: ................................................................ 38095
vusers.created_by_name.0: ...................................................... 38095
vusers.failed: ................................................................. 10711
vusers.session_length:
  min: ......................................................................... 67.6
  max: ......................................................................... 10655.9
  mean: ........................................................................ 2320.4
  median: ...................................................................... 1495.5
  p95: ......................................................................... 8520.7
  p99: ......................................................................... 9801.2


Phase completed: Spike phase (index: 2, duration: 60s) 23:15:18(-0300)

--------------------------------------
Metrics for period to: 23:15:20(-0300) (width: 9.998s)
--------------------------------------

apdex.frustrated: .............................................................. 31065
apdex.satisfied: ............................................................... 742
apdex.tolerated: ............................................................... 1884
errors.ETIMEDOUT: .............................................................. 9106
http.codes.200: ................................................................ 33691
http.downloaded_bytes: ......................................................... 159363
http.request_rate: ............................................................. 3468/sec
http.requests: ................................................................. 31700
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 8945
  mean: ........................................................................ 431.8
  median: ...................................................................... 262.5
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 3752.7
http.responses: ................................................................ 33691
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 33691
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 0
  max: ......................................................................... 8945
  mean: ........................................................................ 431.8
  median: ...................................................................... 262.5
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 3752.7
vusers.completed: .............................................................. 33693
vusers.created: ................................................................ 31694
vusers.created_by_name.0: ...................................................... 31694
vusers.failed: ................................................................. 9106
vusers.session_length:
  min: ......................................................................... 0.7
  max: ......................................................................... 10515.2
  mean: ........................................................................ 2912
  median: ...................................................................... 1863.5
  p95: ......................................................................... 8692.8
  p99: ......................................................................... 9607.1


--------------------------------------
Metrics for period to: 23:15:30(-0300) (width: 5.211s)
--------------------------------------

apdex.frustrated: .............................................................. 3947
apdex.satisfied: ............................................................... 22
apdex.tolerated: ............................................................... 1
errors.ETIMEDOUT: .............................................................. 474
http.codes.200: ................................................................ 3970
http.downloaded_bytes: ......................................................... 18817
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 20
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 8683
  mean: ........................................................................ 334.2
  median: ...................................................................... 57.4
  p95: ......................................................................... 2951.9
  p99: ......................................................................... 5272.4
http.responses: ................................................................ 3970
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 3970
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 0
  max: ......................................................................... 8683
  mean: ........................................................................ 334.2
  median: ...................................................................... 57.4
  p95: ......................................................................... 2951.9
  p99: ......................................................................... 5272.4
vusers.completed: .............................................................. 3970
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 474
vusers.session_length:
  min: ......................................................................... 0.8
  max: ......................................................................... 9797.9
  mean: ........................................................................ 6050.2
  median: ...................................................................... 7557.1
  p95: ......................................................................... 8520.7
  p99: ......................................................................... 8692.8


All VUs finished. Total time: 1 minute, 52 seconds

--------------------------------
Summary report @ 23:15:27(-0300)
--------------------------------

apdex.frustrated: .............................................................. 206873
apdex.satisfied: ............................................................... 3121
apdex.tolerated: ............................................................... 25497
errors.ECONNRESET: ............................................................. 46
errors.ETIMEDOUT: .............................................................. 64793
http.codes.200: ................................................................ 235491
http.downloaded_bytes: ......................................................... 1113803
http.request_rate: ............................................................. 2999/sec
http.requests: ................................................................. 300330
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 9218
  mean: ........................................................................ 397.1
  median: ...................................................................... 257.3
  p95: ......................................................................... 982.6
  p99: ......................................................................... 2951.9
http.responses: ................................................................ 235491
plugins.metrics-by-endpoint./verify-prime.codes.200: ........................... 235491
plugins.metrics-by-endpoint.response_time./verify-prime:
  min: ......................................................................... 0
  max: ......................................................................... 9218
  mean: ........................................................................ 397.1
  median: ...................................................................... 257.3
  p95: ......................................................................... 982.6
  p99: ......................................................................... 2951.9
vusers.completed: .............................................................. 235491
vusers.created: ................................................................ 300330
vusers.created_by_name.0: ...................................................... 300330
vusers.failed: ................................................................. 64839
vusers.session_length:
  min: ......................................................................... 0.7
  max: ......................................................................... 10655.9
  mean: ........................................................................ 2102.9
  median: ...................................................................... 1300.1
  p95: ......................................................................... 8186.6
  p99: ......................................................................... 9230.4

Checks:
fail: maxErrorRate < 1

Apdex score: 0.0673889872649061 (unacceptable)